{// Завдання 1. Ви просите користувача запровадити суму його зарплати. Потім розраховуєте:
//
//     Добавку у вигляді премії у сумі 15% від зарплати.
//     Податки у сумі 10% від суми всіх нарахувань (зарплата + премія).
//     Витрату в магазині в сумі 190.
// Розділяєте суму, що залишилася, між користувачем і його "дружиною"/"чоловіком".
//     При вирішенні використовуйте арифметичні оператори присвоєння, наприклад, res -=100 або res /=2, де res - це змінна,
//     в яку ви записуєте всі дії з розрахунку сум.
//
//     Виводьте скільки залишилося в результаті всіх операцій грошей у користувача.

    // let salary = +prompt('Введіть суму зарплати');

    function remainderSalary(salary) {
        let salaryWithBonus = salary * 1.15;
        let netSalary = salaryWithBonus * 0.9;
        let spending = +prompt('На яку суму скупилися в магазині?');
        return (netSalary - spending) / 2;
    }

    // console.log(remainderSalary(salary));
    
}

{
    // Завдання 2. Потрібно попросити користувача задумати число. Потім він повинен помножити це число на 2 і додати
    // до отриманого результату 7. Те, що сталося в результаті, потрібно ввести у діалоговому вікні prompt().
    // Ви повинні видати користувачеві, скільки він задумав.

    // let number = +prompt('Введіть число');
    const riddledNumber = function (number){
        return (number-7)/2;
    }
    // console.log(riddledNumber(number));
}


{
    // Завдання 3. Попросіть користувача ввести 3 імені та прізвища, наприклад студентів. Виведіть введені дані в тіло документа
    // методом document.write() у вигляді абзаців та нумерованого списку.
    // Використовуйте при виведенні інформації подвійні, одинарні та зворотні лапки.



    // let studentName1 = prompt('Введіть ім\'я та прізвище першого студента');
    // let studentName2 = prompt('Введіть ім\'я та прізвище другого студента');
    // let studentName3 = prompt('Введіть ім\'я та прізвище трєтього студента');

    const allStudents = function (...arr){
            document.write(`<div>`);
                document.write(`<ul>`);
                    for (const arrElement of arr) {
                        document.write(`<li>${arrElement}</li>`);
                    }
                document.write(`</ul>`);
            document.write(`</div>`);
    }
    // allStudents(studentName1, studentName2, studentName3);
}

{
    // Завдання 4. Розв'яжіть просте математичне завдання: 3 особи пішли за покупками. Кожен наступний витратив у 5 разів
    // більше за попередній. Скільки витратив кожен, якщо усі разом заплатили 24 грн 80 коп? 186 грн? 319 грн 30 коп?
    // Запишіть рішення як функції. Викличте цю функцію з різними параметрами. Виводьте інформацію в консоль або за допомогою document.write().
    // Спробуйте повертати з функції об'єкт із трьома значеннями.

    const costs = function (sum){
        let first= sum/31;
        let second = 5*first;
        let third = 5*second;
        return [first, second, third]
    }
    console.log(costs(24.80));
    console.log(costs(186));
    console.log(costs(319.30));

}

{
//     Завдання 5.За допомогою методу prompt() отримайте спочатку ім'я користувача, потім рік його народження та збережіть у 2 змінні.' +
// ' Обчисліть вік користувача та виведіть його в абзаці за допомогою document.write() у такому форматі "Антон: 24".
    let currentYear = 2023;
    let name = prompt('Введіть ім\'я');
    let age = +prompt('Введіть рік народження');


}






















