// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
{
    const arrNum = [4,78,3,876,2];
    const arrStr = ['js', 'html', 'css', 'java', 'php'];
    const arrMixed = [true, 'html', 5454, false, 54564];
    console.log(arrNum);
    console.log(arrStr);
    console.log(arrMixed);
}

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
{
    const arr =[];
    arr[arr.length] = 5;
    arr[arr.length] = 2;
    arr[arr.length] = true;
    arr[arr.length] = 'fdgfg';
    console.log(arr);
}

// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
{
    const arr =[2,17,13,6,22,31,45,66,100,-18];
    let i = 0
    while (i<arr.length){
        console.log(arr[i]);
        i++
    }
}
//     2. перебрати його циклом for
{
    const arr =[2,17,13,6,22,31,45,66,100,-18];
    for (let i = 0; i < arr.length; i++) {
        console.log(arr[i])
    }
}
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
{
    const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
    let i = 0
    while (i < arr.length) {
        if(i%2!==0)
        console.log(arr[i]);
        i++
    }
}
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
{
    const arr =[2,17,13,6,22,31,45,66,100,-18];
    for (let i = 0; i < arr.length; i++) {
        if(i%2!==0){
            console.log(arr[i]);
        }
    }
}
// 5. перебрати циклом while та вивести  числа тільки парні  значення
{
    const arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
    let i = 0
    while (i < arr.length) {
        if(i%2===0)
            console.log(arr[i]);
        i++
    }
}
// 6. перебрати циклом for та вивести  числа тільки парні  значення
{
    const arr =[2,17,13,6,22,31,45,66,100,-18];
    for (let i = 0; i < arr.length; i++) {
        if(i%2===0){
            console.log(arr[i]);
        }
    }
}
// 7. замінити кожне число кратне 3 на слово "okten"
{
    const arr =[2,17,13,6,22,31,45,66,100,-18];
    for (let i = 0; i < arr.length; i++) {
        if(arr[i]%3===0){
            arr[i] = 'octen';
        }
    }
            console.log(arr);
}
// 8. вивести масив в зворотньому порядку.
{
    const arr =[2,17,13,6,22,31,45,66,100,-18];
    const arrReverse =[]
    for (let i = arr.length-1; i >=0 ; i--) {
        arrReverse[arrReverse.length] = arr[i];
    }
    console.log(arr.reverse());
    console.log(arrReverse);
}
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
{
    const arr =[2,17,13,6,22,31,45,66,100,-18];
    for (let i = arr.length-1; i >=0 ; i--) {
        if(i%2===0){
            console.log(arr[i]);
        }
    }
}

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор